<div class="main_page">
    <h3><u>Admission Requirement for Undergraduate Degree</u></h3>
    ১. যে সকল ছাত্রছাত্রী ২০১৩/২০১৪ সালে এস এস সি বা সমমান এবং ২০১৫/২০১৬ সালে এইচ এস সি বা সমমানের পরিক্ষায় উত্তীর্ণ হয়েছে কেবল মাত্র তারাই আবেদন করতে পারবে।
<br> ২. আবেদনকারির অবশ্যই এস এস সি বা সমমানের এবং এইচ এস সি বা সমমানের পরিক্ষায় উভয় ক্ষেত্রে চতুর্থ বিষয় বাদে প্রতিটিতে ন্যূনতম জি পি এ ২.৫ সহ সর্বমোট জি পি এ ৬.০ থাকতে হবে।
বি.এসসি. ইন কম্পিউটার সায়েন্স এন্ড ইঞ্জিনিয়ারিং ডিগ্রির জন্য বিজ্ঞান বিভাগ থেকে এস এস সি বা সমমানের এবং এইচ এস সি বা সমমানের পরিক্ষায় উত্তীর্ণ হতে হবে। প্রার্থীর এইচ এস সি বা সমমানের পরিক্ষায় অবশ্যই তার পঠিত পদার্থবিদ্যা, রসায়ন এবং গণিত সহ সকল বিষয়ের প্রতিটিতে ন্যূনতম জি পি  ২ থাকতে হবে।

</div>